In [1]:
tup1=(1,2,3)
tup2=(4,5,6)
tup1 + tup2

(1, 2, 3, 4, 5, 6)

In [3]:
import numpy as np
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

# how to create a dataframe from lists?

In [4]:
lst1=['neeraj','anuj','ramila','arti']
lst2=['M','M','F','F']
import pandas as pd
df=pd.DataFrame()
df['Name']=lst1
df['Gender']=lst2
df

     Name Gender
0  neeraj      M
1    anuj      M
2  ramila      F
3    arti      F

# How to create a dataframe from a dictionary ?

In [7]:
bike=['Splender','Shine','Royal Enfield','Apache']
car=['Brezza','Carnival','Harrier','Verna']
d={'cars':car,'bikes':bike}
df = pd.DataFrame(d)
df

       cars          bikes
0    Brezza       Splender
1  Carnival          Shine
2   Harrier  Royal Enfield
3     Verna         Apache

# drop all nan values from the dataframe

In [14]:
import numpy as np
col1=[1.0,2.0,np.nan]
col2=['A','B','C']
d={'col1':col1,'col2':col2}
df=pd.DataFrame(d)
df

   col1 col2
0   1.0    A
1   2.0    B
2   NaN    C

In [15]:
df.dropna()

   col1 col2
0   1.0    A
1   2.0    B

In [16]:
df.loc[1]

col1    2.0
col2      B
Name: 1, dtype: object

In [17]:
tup=(1,2,3)

In [18]:
lst=list(tup)

In [21]:
lst.append(8)

In [25]:
tup=tuple(lst)

In [26]:
tup

(1, 2, 3, 1, 8)

# find central tendency of array

In [29]:
import numpy as np
n1=np.array([10,20,30,40,50])
print(np.mean(n1))
print(np.median(n1))
print(np.std(n1))

30.0
30.0
14.142135623730951

In [30]:
str1='Neeraj Nishad RamKishan'
str1.lower()

'neeraj nishad ramkishan'

In [31]:
d

{'col1': [1.0, 2.0, nan], 'col2': ['A', 'B', 'C']}

In [34]:
d.keys()

dict_keys(['col1', 'col2'])

In [35]:
str1

'Neeraj Nishad RamKishan'

In [36]:
str1.capitalize()

'Neeraj nishad ramkishan'

# how can you insert an element at a given index in python?

In [37]:
lst

[1, 2, 3, 1, 8]

In [38]:
lst.insert(2,50)

In [39]:
lst

[1, 2, 50, 3, 1, 8]

# what is map function in python ?

In [3]:
lst=[1,2,3,4]
list(map(lambda x:x**3,lst))

[1, 8, 27, 64]

In [4]:
set1={1,3,4,5,5}

In [7]:
len(set1)

4

# factorial of number using recursion?

In [14]:
def factorial(num):
    if num==0 or num==1:
        return 1
    return num*factorial(num-1)

In [15]:
factorial(5)

120

In [16]:
a=1
b='neeraj'
c=0

In [17]:
print(bool(a),bool(b),bool(c))

True True False

In [18]:
col1=[1,2,3,4,5]
col2=[10,20,30,40,50]
d={'col1':col1,'col2':col2}
import pandas as pd
df = pd.DataFrame(d)

In [19]:
df

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [20]:
df['sum']=df['col1']+df['col2']
df['sub']=df['col2']-df['col1']

In [26]:
df['col1']=df['col1']

In [22]:
df1=pd.DataFrame()

In [ ]:
df

In [28]:
df1['new_col1']=df['col1']

In [25]:
df1

   new_col1
0         1
1         2
2         3
3         4
4         5

In [32]:
col3=[1,2,3,8,9]
df['col1']=col3

In [33]:
df

   col1  col2  sum  sub
0     1    10   11    9
1     2    20   22   18
2     3    30   33   27
3     8    40   44   36
4     9    50   55   45

In [34]:
new_df=pd.DataFrame()

In [40]:
col1=[1,2,3]
col2=[4,5,6]
new_df['col1']=col2
new_df['col1']=col1

In [41]:
new_df

   col1
0     1
1     2
2     3

In [37]:
import pandas as pd

df1 = pd.DataFrame({"name": ["Alice", "Bob", "Carol"], "age": [25, 30, 35]})
df2 = pd.DataFrame({"name": ["Dave", "Eve", "Frank"], "age": [40, 45, 50]})

# Concatenate the DataFrames along the rows axis.
df = pd.concat([df1, df2], axis=0)

# Print the DataFrame.
print(df)

    name  age
0  Alice   25
1    Bob   30
2  Carol   35
0   Dave   40
1    Eve   45
2  Frank   50

In [42]:
df

    name  age
0  Alice   25
1    Bob   30
2  Carol   35
0   Dave   40
1    Eve   45
2  Frank   50

In [43]:
df.drop(['name'],axis=1)

   age
0   25
1   30
2   35
0   40
1   45
2   50

In [44]:
col1=[1,2,3]
col2=['A','B','C']
df2=pd.DataFrame()
df2['col1']=col1
df2['col2']=col2
df2

   col1 col2
0     1    A
1     2    B
2     3    C

In [50]:
df2.dropna(inplace=True)
df2=df2[df2.col1!=1]

C:\Users\lenovo\AppData\Local\Temp\ipykernel_13948\4233864323.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.dropna(inplace=True)

In [51]:
df2

   col1 col2
1     2    B
2     3    C